<a href="https://colab.research.google.com/github/constanza1993/coni-icaro/blob/master/Pandas3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [12]:
df= pd.read_csv('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/stock_data.csv')

In [13]:
df.head(10)

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [14]:
df.describe()

       Precio Apertura  Precio Cierre
count          5.00000       5.000000
mean          33.20000      34.600000
std            4.38178       1.949359
min           28.00000      32.000000
25%           32.00000      34.000000
50%           32.00000      34.000000
75%           34.00000      36.000000
max           40.00000      37.000000

In [15]:
df.groupby(['Resumen']).count()

          Dia  Precio Apertura  Precio Cierre
Resumen
Ganancia    4                4              2
Perdida     3                1              2

In [17]:
col = df['Precio Cierre']
type(col)

pandas.core.series.Series

In [27]:
import requests

In [32]:
import requests
csv_url = 'https://www1.ncdc.noaa.gov/pub/data/cdo/samples/PRECIP_HLY_sample_csv.csv'
req = requests.get(csv_url)
url_content = req.content
precip_sample_file_name = 'precip_sample.csv'
csv_file = open(precip_sample_file_name, 'wb')
csv_file.write(url_content)
csv_file.close()

In [36]:
import pandas as pd
df = 'precip_sample.csv'

In [38]:
df = pd.read_csv('https://www1.ncdc.noaa.gov/pub/data/cdo/samples/PRECIP_HLY_sample_csv.csv')

In [39]:
df.describe()

       ELEVATION  LATITUDE  LONGITUDE          HPCP
count        3.0    3.0000     3.0000      3.000000
mean       682.1   35.5954   -82.5568  33333.333333
std          0.0    0.0000     0.0000  57734.160896
min        682.1   35.5954   -82.5568      0.000000
25%        682.1   35.5954   -82.5568      0.500000
50%        682.1   35.5954   -82.5568      1.000000
75%        682.1   35.5954   -82.5568  50000.000000
max        682.1   35.5954   -82.5568  99999.000000

In [41]:
df.head()

       STATION     STATION_NAME  ELEVATION  ...   HPCP  Measurement Flag Quality Flag
0  COOP:310301  ASHEVILLE NC US      682.1  ...  99999                 ]
1  COOP:310301  ASHEVILLE NC US      682.1  ...      0                 g
2  COOP:310301  ASHEVILLE NC US      682.1  ...      1

[3 rows x 9 columns]

In [43]:
df.shape

(3, 9)

In [54]:
df = pd.read_csv('https://raw.githubusercontent.com/MohaRios/datos_para_ejercicios/master/cotizacion.csv', sep= ';')
df.head(20)

          Nombre   Final  Máximo  Mínimo     Volumen   Efectivo
0        ACCIONA   95,95   96,75    94,4      84.962    8166,11
1       ACERINOX    8668    8672    8468      885.99    7633,81
2            ACS   37,28   37,66   37,22     655.982   24517,29
3           AENA   167,1   167,5   166,1     133.738   22336,10
4        AMADEUS   69,96   70,64   69,56     640.476   44795,47
5    ARCELORMIT.   14152   14318   14,08     702.841    9989,65
6    BA.SABADELL  1,0165    1033  1,0165  12.358.512   12637,65
7   BA.SANTANDER    4,02  4,0675    4,01  36.129.692  145765,44
8         BANKIA    2249    2262    2224   3.024.454    6803,54
9      BANKINTER    6,56    6604    6522   1.375.976    9030,20
10          BBVA    5024    5,05    4969  26.447.612  132560,15
11     CAIXABANK    2763    2806    2762  13.031.097   36239,22
12       CELLNEX   30,17    30,7   30,17     857.237   25965,29
13  CIE AUTOMOT.   23,44   23,74    23,4      99.506    2343,09
14        ENAGAS    25,6   25,66   25,07      842.54   21524,77
15          ENCE    3882    3974    3846   2.099.698    8219,83
16        ENDESA   22,95   23,03   22,62   1.236.799   28233,46
17     FERROVIAL   21,61   21,72   21,38   2.065.931   44656,05
18  GRIFOLS CL.A    23,3    23,6   23,27     719.503   16787,55
19           IAG     5,3    5,46    5292   2.155.081   11561,95

In [53]:
df.Nombre.value_counts()

BA.SANTANDER    1
INDRA A         1
REPSOL          1
IAG             1
R.E.C.          1
TEC.REUNIDAS    1
INM.COLONIAL    1
MERLIN          1
IBERDROLA       1
ENCE            1
TELEFONICA      1
FERROVIAL       1
MELIA HOTELS    1
CIE AUTOMOT.    1
CAIXABANK       1
VISCOFAN        1
ENAGAS          1
INDITEX         1
AMADEUS         1
AENA            1
NATURGY         1
ACCIONA         1
ARCELORMIT.     1
ACERINOX        1
BA.SABADELL     1
BBVA            1
CELLNEX         1
ENDESA          1
BANKINTER       1
SIEMENS GAME    1
ACS             1
MAPFRE          1
BANKIA          1
GRIFOLS CL.A    1
MEDIASET        1
Name: Nombre, dtype: int64

In [58]:
df.iloc[df['Volumen'].idxmax()]

TypeError: ignored

In [60]:
df.query('Volumen == Volumen.max()')

          Nombre  Final Máximo Mínimo Volumen Efectivo
13  CIE AUTOMOT.  23,44  23,74   23,4  99.506  2343,09

In [62]:
df.shape

(35, 6)

In [68]:
df['Volumen_sin_puntos'] = df['Volumen'].apply(replace('.',""))

NameError: ignored